public_html/git.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">git</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5541c5b">0.1. Borrar último commit (Si el repositorio local y el remoto están sincronizados)</a></li>
<li><a href="#org866a137">0.2. Actualizar el repositorio local -&gt; git fetch</a></li>
</ul>
</li>
<li><a href="#org344cab5">1. Gitlab</a>
<ul>
<li><a href="#orgfa6dfa0">1.1. Servir directorio como html estático</a></li>
</ul>
</div>
</div>
<p>
Git es un software de control de versiones diseñado por Linus Torvalds, pensando en la eficiencia, la confiabilidad y compatibilidad del mantenimiento de versiones de aplicaciones cuando estas tienen un gran número de archivos de código fuente. Su propósito es llevar registro de los cambios en archivos de computadora incluyendo coordinar el trabajo que varias personas realizan sobre archivos compartidos en un repositorio de código.
</p>

<div id="outline-container-org5541c5b" class="outline-3">
<h3 id="org5541c5b"><span class="section-number-3">0.1.</span> Borrar último commit (Si el repositorio local y el remoto están sincronizados)</h3>
<div class="outline-text-3" id="text-0-1">
<p>
git reset HEAD^ &#x2013;hard
git push origin -f
</p>
</div>
</div>
<div id="outline-container-org866a137" class="outline-3">
<h3 id="org866a137"><span class="section-number-3">0.2.</span> Actualizar el repositorio local -&gt; git fetch</h3>
</div>
<div id="outline-container-org344cab5" class="outline-2">
<h2 id="org344cab5"><span class="section-number-2">1.</span> Gitlab</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfa6dfa0" class="outline-3">
<h3 id="orgfa6dfa0"><span class="section-number-3">1.1.</span> Servir directorio como html estático</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Este es el contenido del archivo ".gitlab-ci.yml" situado en la raiz del repositorio, se publicará la carpeta "public"
</p>
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #cae682;">image</span>: busybox

<span style="color: #cae682;">pages</span>:
  <span style="color: #cae682;">stage</span>: deploy
  <span style="color: #cae682;">environment</span>: production
  <span style="color: #cae682;">script</span>:
    - echo <span style="color: #95e454;">"The site will be deployed to $CI_PAGES_URL"</span>
  <span style="color: #cae682;">artifacts</span>:
    <span style="color: #cae682;">paths</span>:
      - public
  <span style="color: #cae682;">rules</span>:
    - <span style="color: #cae682;">if</span>: $CI_COMMIT_BRANCH == $CI_DEFAULT_BRANCH
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-30 mié 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
